export { holidayMap, vacationMap, overtimeMap, leaveMap };

const holidayMap: Record<number, any> = {
  2023: {},
  2024: {
    1: { 1: "元旦" },
    2: { 9: "除夕", 10: "春节" },
    4: { 4: "清明" },
    5: { 1: "劳动" },
    6: { 10: "端午" },
    9: { 17: "中秋" },
    10: { 1: "国庆" },
  },
};

const vacationMap: Record<number, any> = {
  2023: {
    12: [30, 31],
  },
  2024: {
    1: [1],
    2: [10, 11, 12, 13, 14, 15, 16, 17],
    4: [4, 5, 6],
    5: [1, 2, 3, 4, 5],
    6: [8, 9, 10],
    9: [15, 16, 17],
    10: [1, 2, 3, 4, 5, 6, 7],
  },
};

const overtimeMap: Record<number, any> = {
  2023: {},
  2024: { 2: [4, 9, 18], 4: [7, 28], 5: [11], 9: [14, 29], 10: [12] },
};

const leaveMap: Record<number, any> = {
  2023: {},
  2024: {
    1: [2, 3, 4, 5],
    2: [18, 19, 20, 21, 22, 23],
    4: [1, 2, 3, 28, 29, 30],
    6: [11, 12, 13, 14],
    9: [18, 19, 20, 29, 30],
  },
};
